name: "ResNet_200"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    force_color: true
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 32
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    force_color: true
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 25
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "conv2_res1_proj"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_res1_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res1_conv1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_res1_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res1_conv1_bn"
  type: "BatchNorm"
  bottom: "conv2_res1_conv1"
  top: "conv2_res1_conv1"
}
layer {
  name: "conv2_res1_conv1_scale"
  type: "Scale"
  bottom: "conv2_res1_conv1"
  top: "conv2_res1_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res1_conv1_relu"
  type: "ReLU"
  bottom: "conv2_res1_conv1"
  top: "conv2_res1_conv1"
}
layer {
  name: "conv2_res1_conv2"
  type: "Convolution"
  bottom: "conv2_res1_conv1"
  top: "conv2_res1_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res1_conv2_bn"
  type: "BatchNorm"
  bottom: "conv2_res1_conv2"
  top: "conv2_res1_conv2"
}
layer {
  name: "conv2_res1_conv2_scale"
  type: "Scale"
  bottom: "conv2_res1_conv2"
  top: "conv2_res1_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res1_conv2_relu"
  type: "ReLU"
  bottom: "conv2_res1_conv2"
  top: "conv2_res1_conv2"
}
layer {
  name: "conv2_res1_conv3"
  type: "Convolution"
  bottom: "conv2_res1_conv2"
  top: "conv2_res1_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res1"
  type: "Eltwise"
  bottom: "conv2_res1_proj"
  bottom: "conv2_res1_conv3"
  top: "conv2_res1"
}
layer {
  name: "conv2_res2_pre_bn"
  type: "BatchNorm"
  bottom: "conv2_res1"
  top: "conv2_res2_pre"
}
layer {
  name: "conv2_res2_pre_scale"
  type: "Scale"
  bottom: "conv2_res2_pre"
  top: "conv2_res2_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res2_pre_relu"
  type: "ReLU"
  bottom: "conv2_res2_pre"
  top: "conv2_res2_pre"
}
layer {
  name: "conv2_res2_conv1"
  type: "Convolution"
  bottom: "conv2_res2_pre"
  top: "conv2_res2_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res2_conv1_bn"
  type: "BatchNorm"
  bottom: "conv2_res2_conv1"
  top: "conv2_res2_conv1"
}
layer {
  name: "conv2_res2_conv1_scale"
  type: "Scale"
  bottom: "conv2_res2_conv1"
  top: "conv2_res2_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res2_conv1_relu"
  type: "ReLU"
  bottom: "conv2_res2_conv1"
  top: "conv2_res2_conv1"
}
layer {
  name: "conv2_res2_conv2"
  type: "Convolution"
  bottom: "conv2_res2_conv1"
  top: "conv2_res2_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res2_conv2_bn"
  type: "BatchNorm"
  bottom: "conv2_res2_conv2"
  top: "conv2_res2_conv2"
}
layer {
  name: "conv2_res2_conv2_scale"
  type: "Scale"
  bottom: "conv2_res2_conv2"
  top: "conv2_res2_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res2_conv2_relu"
  type: "ReLU"
  bottom: "conv2_res2_conv2"
  top: "conv2_res2_conv2"
}
layer {
  name: "conv2_res2_conv3"
  type: "Convolution"
  bottom: "conv2_res2_conv2"
  top: "conv2_res2_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res2"
  type: "Eltwise"
  bottom: "conv2_res1"
  bottom: "conv2_res2_conv3"
  top: "conv2_res2"
}
layer {
  name: "conv2_res3_pre_bn"
  type: "BatchNorm"
  bottom: "conv2_res2"
  top: "conv2_res3_pre"
}
layer {
  name: "conv2_res3_pre_scale"
  type: "Scale"
  bottom: "conv2_res3_pre"
  top: "conv2_res3_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res3_pre_relu"
  type: "ReLU"
  bottom: "conv2_res3_pre"
  top: "conv2_res3_pre"
}
layer {
  name: "conv2_res3_conv1"
  type: "Convolution"
  bottom: "conv2_res3_pre"
  top: "conv2_res3_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res3_conv1_bn"
  type: "BatchNorm"
  bottom: "conv2_res3_conv1"
  top: "conv2_res3_conv1"
}
layer {
  name: "conv2_res3_conv1_scale"
  type: "Scale"
  bottom: "conv2_res3_conv1"
  top: "conv2_res3_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res3_conv1_relu"
  type: "ReLU"
  bottom: "conv2_res3_conv1"
  top: "conv2_res3_conv1"
}
layer {
  name: "conv2_res3_conv2"
  type: "Convolution"
  bottom: "conv2_res3_conv1"
  top: "conv2_res3_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res3_conv2_bn"
  type: "BatchNorm"
  bottom: "conv2_res3_conv2"
  top: "conv2_res3_conv2"
}
layer {
  name: "conv2_res3_conv2_scale"
  type: "Scale"
  bottom: "conv2_res3_conv2"
  top: "conv2_res3_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv2_res3_conv2_relu"
  type: "ReLU"
  bottom: "conv2_res3_conv2"
  top: "conv2_res3_conv2"
}
layer {
  name: "conv2_res3_conv3"
  type: "Convolution"
  bottom: "conv2_res3_conv2"
  top: "conv2_res3_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_res3"
  type: "Eltwise"
  bottom: "conv2_res2"
  bottom: "conv2_res3_conv3"
  top: "conv2_res3"
}
layer {
  name: "conv3_res1_pre_bn"
  type: "BatchNorm"
  bottom: "conv2_res3"
  top: "conv3_res1_pre"
}
layer {
  name: "conv3_res1_pre_scale"
  type: "Scale"
  bottom: "conv3_res1_pre"
  top: "conv3_res1_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res1_pre_relu"
  type: "ReLU"
  bottom: "conv3_res1_pre"
  top: "conv3_res1_pre"
}
layer {
  name: "conv3_res1_proj"
  type: "Convolution"
  bottom: "conv3_res1_pre"
  top: "conv3_res1_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res1_conv1"
  type: "Convolution"
  bottom: "conv3_res1_pre"
  top: "conv3_res1_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res1_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res1_conv1"
  top: "conv3_res1_conv1"
}
layer {
  name: "conv3_res1_conv1_scale"
  type: "Scale"
  bottom: "conv3_res1_conv1"
  top: "conv3_res1_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res1_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res1_conv1"
  top: "conv3_res1_conv1"
}
layer {
  name: "conv3_res1_conv2"
  type: "Convolution"
  bottom: "conv3_res1_conv1"
  top: "conv3_res1_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res1_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res1_conv2"
  top: "conv3_res1_conv2"
}
layer {
  name: "conv3_res1_conv2_scale"
  type: "Scale"
  bottom: "conv3_res1_conv2"
  top: "conv3_res1_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res1_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res1_conv2"
  top: "conv3_res1_conv2"
}
layer {
  name: "conv3_res1_conv3"
  type: "Convolution"
  bottom: "conv3_res1_conv2"
  top: "conv3_res1_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res1"
  type: "Eltwise"
  bottom: "conv3_res1_proj"
  bottom: "conv3_res1_conv3"
  top: "conv3_res1"
}
layer {
  name: "conv3_res2_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res1"
  top: "conv3_res2_pre"
}
layer {
  name: "conv3_res2_pre_scale"
  type: "Scale"
  bottom: "conv3_res2_pre"
  top: "conv3_res2_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res2_pre_relu"
  type: "ReLU"
  bottom: "conv3_res2_pre"
  top: "conv3_res2_pre"
}
layer {
  name: "conv3_res2_conv1"
  type: "Convolution"
  bottom: "conv3_res2_pre"
  top: "conv3_res2_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res2_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res2_conv1"
  top: "conv3_res2_conv1"
}
layer {
  name: "conv3_res2_conv1_scale"
  type: "Scale"
  bottom: "conv3_res2_conv1"
  top: "conv3_res2_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res2_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res2_conv1"
  top: "conv3_res2_conv1"
}
layer {
  name: "conv3_res2_conv2"
  type: "Convolution"
  bottom: "conv3_res2_conv1"
  top: "conv3_res2_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res2_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res2_conv2"
  top: "conv3_res2_conv2"
}
layer {
  name: "conv3_res2_conv2_scale"
  type: "Scale"
  bottom: "conv3_res2_conv2"
  top: "conv3_res2_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res2_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res2_conv2"
  top: "conv3_res2_conv2"
}
layer {
  name: "conv3_res2_conv3"
  type: "Convolution"
  bottom: "conv3_res2_conv2"
  top: "conv3_res2_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res2"
  type: "Eltwise"
  bottom: "conv3_res1"
  bottom: "conv3_res2_conv3"
  top: "conv3_res2"
}
layer {
  name: "conv3_res3_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res2"
  top: "conv3_res3_pre"
}
layer {
  name: "conv3_res3_pre_scale"
  type: "Scale"
  bottom: "conv3_res3_pre"
  top: "conv3_res3_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res3_pre_relu"
  type: "ReLU"
  bottom: "conv3_res3_pre"
  top: "conv3_res3_pre"
}
layer {
  name: "conv3_res3_conv1"
  type: "Convolution"
  bottom: "conv3_res3_pre"
  top: "conv3_res3_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res3_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res3_conv1"
  top: "conv3_res3_conv1"
}
layer {
  name: "conv3_res3_conv1_scale"
  type: "Scale"
  bottom: "conv3_res3_conv1"
  top: "conv3_res3_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res3_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res3_conv1"
  top: "conv3_res3_conv1"
}
layer {
  name: "conv3_res3_conv2"
  type: "Convolution"
  bottom: "conv3_res3_conv1"
  top: "conv3_res3_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res3_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res3_conv2"
  top: "conv3_res3_conv2"
}
layer {
  name: "conv3_res3_conv2_scale"
  type: "Scale"
  bottom: "conv3_res3_conv2"
  top: "conv3_res3_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res3_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res3_conv2"
  top: "conv3_res3_conv2"
}
layer {
  name: "conv3_res3_conv3"
  type: "Convolution"
  bottom: "conv3_res3_conv2"
  top: "conv3_res3_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res3"
  type: "Eltwise"
  bottom: "conv3_res2"
  bottom: "conv3_res3_conv3"
  top: "conv3_res3"
}
layer {
  name: "conv3_res4_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res3"
  top: "conv3_res4_pre"
}
layer {
  name: "conv3_res4_pre_scale"
  type: "Scale"
  bottom: "conv3_res4_pre"
  top: "conv3_res4_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res4_pre_relu"
  type: "ReLU"
  bottom: "conv3_res4_pre"
  top: "conv3_res4_pre"
}
layer {
  name: "conv3_res4_conv1"
  type: "Convolution"
  bottom: "conv3_res4_pre"
  top: "conv3_res4_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res4_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res4_conv1"
  top: "conv3_res4_conv1"
}
layer {
  name: "conv3_res4_conv1_scale"
  type: "Scale"
  bottom: "conv3_res4_conv1"
  top: "conv3_res4_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res4_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res4_conv1"
  top: "conv3_res4_conv1"
}
layer {
  name: "conv3_res4_conv2"
  type: "Convolution"
  bottom: "conv3_res4_conv1"
  top: "conv3_res4_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res4_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res4_conv2"
  top: "conv3_res4_conv2"
}
layer {
  name: "conv3_res4_conv2_scale"
  type: "Scale"
  bottom: "conv3_res4_conv2"
  top: "conv3_res4_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res4_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res4_conv2"
  top: "conv3_res4_conv2"
}
layer {
  name: "conv3_res4_conv3"
  type: "Convolution"
  bottom: "conv3_res4_conv2"
  top: "conv3_res4_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res4"
  type: "Eltwise"
  bottom: "conv3_res3"
  bottom: "conv3_res4_conv3"
  top: "conv3_res4"
}
layer {
  name: "conv3_res5_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res4"
  top: "conv3_res5_pre"
}
layer {
  name: "conv3_res5_pre_scale"
  type: "Scale"
  bottom: "conv3_res5_pre"
  top: "conv3_res5_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res5_pre_relu"
  type: "ReLU"
  bottom: "conv3_res5_pre"
  top: "conv3_res5_pre"
}
layer {
  name: "conv3_res5_conv1"
  type: "Convolution"
  bottom: "conv3_res5_pre"
  top: "conv3_res5_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res5_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res5_conv1"
  top: "conv3_res5_conv1"
}
layer {
  name: "conv3_res5_conv1_scale"
  type: "Scale"
  bottom: "conv3_res5_conv1"
  top: "conv3_res5_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res5_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res5_conv1"
  top: "conv3_res5_conv1"
}
layer {
  name: "conv3_res5_conv2"
  type: "Convolution"
  bottom: "conv3_res5_conv1"
  top: "conv3_res5_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res5_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res5_conv2"
  top: "conv3_res5_conv2"
}
layer {
  name: "conv3_res5_conv2_scale"
  type: "Scale"
  bottom: "conv3_res5_conv2"
  top: "conv3_res5_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res5_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res5_conv2"
  top: "conv3_res5_conv2"
}
layer {
  name: "conv3_res5_conv3"
  type: "Convolution"
  bottom: "conv3_res5_conv2"
  top: "conv3_res5_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res5"
  type: "Eltwise"
  bottom: "conv3_res4"
  bottom: "conv3_res5_conv3"
  top: "conv3_res5"
}
layer {
  name: "conv3_res6_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res5"
  top: "conv3_res6_pre"
}
layer {
  name: "conv3_res6_pre_scale"
  type: "Scale"
  bottom: "conv3_res6_pre"
  top: "conv3_res6_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res6_pre_relu"
  type: "ReLU"
  bottom: "conv3_res6_pre"
  top: "conv3_res6_pre"
}
layer {
  name: "conv3_res6_conv1"
  type: "Convolution"
  bottom: "conv3_res6_pre"
  top: "conv3_res6_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res6_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res6_conv1"
  top: "conv3_res6_conv1"
}
layer {
  name: "conv3_res6_conv1_scale"
  type: "Scale"
  bottom: "conv3_res6_conv1"
  top: "conv3_res6_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res6_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res6_conv1"
  top: "conv3_res6_conv1"
}
layer {
  name: "conv3_res6_conv2"
  type: "Convolution"
  bottom: "conv3_res6_conv1"
  top: "conv3_res6_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res6_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res6_conv2"
  top: "conv3_res6_conv2"
}
layer {
  name: "conv3_res6_conv2_scale"
  type: "Scale"
  bottom: "conv3_res6_conv2"
  top: "conv3_res6_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res6_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res6_conv2"
  top: "conv3_res6_conv2"
}
layer {
  name: "conv3_res6_conv3"
  type: "Convolution"
  bottom: "conv3_res6_conv2"
  top: "conv3_res6_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res6"
  type: "Eltwise"
  bottom: "conv3_res5"
  bottom: "conv3_res6_conv3"
  top: "conv3_res6"
}
layer {
  name: "conv3_res7_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res6"
  top: "conv3_res7_pre"
}
layer {
  name: "conv3_res7_pre_scale"
  type: "Scale"
  bottom: "conv3_res7_pre"
  top: "conv3_res7_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res7_pre_relu"
  type: "ReLU"
  bottom: "conv3_res7_pre"
  top: "conv3_res7_pre"
}
layer {
  name: "conv3_res7_conv1"
  type: "Convolution"
  bottom: "conv3_res7_pre"
  top: "conv3_res7_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res7_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res7_conv1"
  top: "conv3_res7_conv1"
}
layer {
  name: "conv3_res7_conv1_scale"
  type: "Scale"
  bottom: "conv3_res7_conv1"
  top: "conv3_res7_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res7_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res7_conv1"
  top: "conv3_res7_conv1"
}
layer {
  name: "conv3_res7_conv2"
  type: "Convolution"
  bottom: "conv3_res7_conv1"
  top: "conv3_res7_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res7_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res7_conv2"
  top: "conv3_res7_conv2"
}
layer {
  name: "conv3_res7_conv2_scale"
  type: "Scale"
  bottom: "conv3_res7_conv2"
  top: "conv3_res7_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res7_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res7_conv2"
  top: "conv3_res7_conv2"
}
layer {
  name: "conv3_res7_conv3"
  type: "Convolution"
  bottom: "conv3_res7_conv2"
  top: "conv3_res7_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res7"
  type: "Eltwise"
  bottom: "conv3_res6"
  bottom: "conv3_res7_conv3"
  top: "conv3_res7"
}
layer {
  name: "conv3_res8_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res7"
  top: "conv3_res8_pre"
}
layer {
  name: "conv3_res8_pre_scale"
  type: "Scale"
  bottom: "conv3_res8_pre"
  top: "conv3_res8_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res8_pre_relu"
  type: "ReLU"
  bottom: "conv3_res8_pre"
  top: "conv3_res8_pre"
}
layer {
  name: "conv3_res8_conv1"
  type: "Convolution"
  bottom: "conv3_res8_pre"
  top: "conv3_res8_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res8_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res8_conv1"
  top: "conv3_res8_conv1"
}
layer {
  name: "conv3_res8_conv1_scale"
  type: "Scale"
  bottom: "conv3_res8_conv1"
  top: "conv3_res8_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res8_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res8_conv1"
  top: "conv3_res8_conv1"
}
layer {
  name: "conv3_res8_conv2"
  type: "Convolution"
  bottom: "conv3_res8_conv1"
  top: "conv3_res8_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res8_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res8_conv2"
  top: "conv3_res8_conv2"
}
layer {
  name: "conv3_res8_conv2_scale"
  type: "Scale"
  bottom: "conv3_res8_conv2"
  top: "conv3_res8_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res8_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res8_conv2"
  top: "conv3_res8_conv2"
}
layer {
  name: "conv3_res8_conv3"
  type: "Convolution"
  bottom: "conv3_res8_conv2"
  top: "conv3_res8_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res8"
  type: "Eltwise"
  bottom: "conv3_res7"
  bottom: "conv3_res8_conv3"
  top: "conv3_res8"
}
layer {
  name: "conv3_res9_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res8"
  top: "conv3_res9_pre"
}
layer {
  name: "conv3_res9_pre_scale"
  type: "Scale"
  bottom: "conv3_res9_pre"
  top: "conv3_res9_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res9_pre_relu"
  type: "ReLU"
  bottom: "conv3_res9_pre"
  top: "conv3_res9_pre"
}
layer {
  name: "conv3_res9_conv1"
  type: "Convolution"
  bottom: "conv3_res9_pre"
  top: "conv3_res9_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res9_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res9_conv1"
  top: "conv3_res9_conv1"
}
layer {
  name: "conv3_res9_conv1_scale"
  type: "Scale"
  bottom: "conv3_res9_conv1"
  top: "conv3_res9_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res9_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res9_conv1"
  top: "conv3_res9_conv1"
}
layer {
  name: "conv3_res9_conv2"
  type: "Convolution"
  bottom: "conv3_res9_conv1"
  top: "conv3_res9_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res9_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res9_conv2"
  top: "conv3_res9_conv2"
}
layer {
  name: "conv3_res9_conv2_scale"
  type: "Scale"
  bottom: "conv3_res9_conv2"
  top: "conv3_res9_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res9_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res9_conv2"
  top: "conv3_res9_conv2"
}
layer {
  name: "conv3_res9_conv3"
  type: "Convolution"
  bottom: "conv3_res9_conv2"
  top: "conv3_res9_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res9"
  type: "Eltwise"
  bottom: "conv3_res8"
  bottom: "conv3_res9_conv3"
  top: "conv3_res9"
}
layer {
  name: "conv3_res10_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res9"
  top: "conv3_res10_pre"
}
layer {
  name: "conv3_res10_pre_scale"
  type: "Scale"
  bottom: "conv3_res10_pre"
  top: "conv3_res10_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res10_pre_relu"
  type: "ReLU"
  bottom: "conv3_res10_pre"
  top: "conv3_res10_pre"
}
layer {
  name: "conv3_res10_conv1"
  type: "Convolution"
  bottom: "conv3_res10_pre"
  top: "conv3_res10_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res10_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res10_conv1"
  top: "conv3_res10_conv1"
}
layer {
  name: "conv3_res10_conv1_scale"
  type: "Scale"
  bottom: "conv3_res10_conv1"
  top: "conv3_res10_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res10_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res10_conv1"
  top: "conv3_res10_conv1"
}
layer {
  name: "conv3_res10_conv2"
  type: "Convolution"
  bottom: "conv3_res10_conv1"
  top: "conv3_res10_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res10_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res10_conv2"
  top: "conv3_res10_conv2"
}
layer {
  name: "conv3_res10_conv2_scale"
  type: "Scale"
  bottom: "conv3_res10_conv2"
  top: "conv3_res10_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res10_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res10_conv2"
  top: "conv3_res10_conv2"
}
layer {
  name: "conv3_res10_conv3"
  type: "Convolution"
  bottom: "conv3_res10_conv2"
  top: "conv3_res10_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res10"
  type: "Eltwise"
  bottom: "conv3_res9"
  bottom: "conv3_res10_conv3"
  top: "conv3_res10"
}
layer {
  name: "conv3_res11_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res10"
  top: "conv3_res11_pre"
}
layer {
  name: "conv3_res11_pre_scale"
  type: "Scale"
  bottom: "conv3_res11_pre"
  top: "conv3_res11_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res11_pre_relu"
  type: "ReLU"
  bottom: "conv3_res11_pre"
  top: "conv3_res11_pre"
}
layer {
  name: "conv3_res11_conv1"
  type: "Convolution"
  bottom: "conv3_res11_pre"
  top: "conv3_res11_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res11_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res11_conv1"
  top: "conv3_res11_conv1"
}
layer {
  name: "conv3_res11_conv1_scale"
  type: "Scale"
  bottom: "conv3_res11_conv1"
  top: "conv3_res11_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res11_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res11_conv1"
  top: "conv3_res11_conv1"
}
layer {
  name: "conv3_res11_conv2"
  type: "Convolution"
  bottom: "conv3_res11_conv1"
  top: "conv3_res11_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res11_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res11_conv2"
  top: "conv3_res11_conv2"
}
layer {
  name: "conv3_res11_conv2_scale"
  type: "Scale"
  bottom: "conv3_res11_conv2"
  top: "conv3_res11_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res11_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res11_conv2"
  top: "conv3_res11_conv2"
}
layer {
  name: "conv3_res11_conv3"
  type: "Convolution"
  bottom: "conv3_res11_conv2"
  top: "conv3_res11_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res11"
  type: "Eltwise"
  bottom: "conv3_res10"
  bottom: "conv3_res11_conv3"
  top: "conv3_res11"
}
layer {
  name: "conv3_res12_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res11"
  top: "conv3_res12_pre"
}
layer {
  name: "conv3_res12_pre_scale"
  type: "Scale"
  bottom: "conv3_res12_pre"
  top: "conv3_res12_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res12_pre_relu"
  type: "ReLU"
  bottom: "conv3_res12_pre"
  top: "conv3_res12_pre"
}
layer {
  name: "conv3_res12_conv1"
  type: "Convolution"
  bottom: "conv3_res12_pre"
  top: "conv3_res12_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res12_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res12_conv1"
  top: "conv3_res12_conv1"
}
layer {
  name: "conv3_res12_conv1_scale"
  type: "Scale"
  bottom: "conv3_res12_conv1"
  top: "conv3_res12_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res12_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res12_conv1"
  top: "conv3_res12_conv1"
}
layer {
  name: "conv3_res12_conv2"
  type: "Convolution"
  bottom: "conv3_res12_conv1"
  top: "conv3_res12_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res12_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res12_conv2"
  top: "conv3_res12_conv2"
}
layer {
  name: "conv3_res12_conv2_scale"
  type: "Scale"
  bottom: "conv3_res12_conv2"
  top: "conv3_res12_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res12_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res12_conv2"
  top: "conv3_res12_conv2"
}
layer {
  name: "conv3_res12_conv3"
  type: "Convolution"
  bottom: "conv3_res12_conv2"
  top: "conv3_res12_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res12"
  type: "Eltwise"
  bottom: "conv3_res11"
  bottom: "conv3_res12_conv3"
  top: "conv3_res12"
}
layer {
  name: "conv3_res13_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res12"
  top: "conv3_res13_pre"
}
layer {
  name: "conv3_res13_pre_scale"
  type: "Scale"
  bottom: "conv3_res13_pre"
  top: "conv3_res13_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res13_pre_relu"
  type: "ReLU"
  bottom: "conv3_res13_pre"
  top: "conv3_res13_pre"
}
layer {
  name: "conv3_res13_conv1"
  type: "Convolution"
  bottom: "conv3_res13_pre"
  top: "conv3_res13_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res13_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res13_conv1"
  top: "conv3_res13_conv1"
}
layer {
  name: "conv3_res13_conv1_scale"
  type: "Scale"
  bottom: "conv3_res13_conv1"
  top: "conv3_res13_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res13_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res13_conv1"
  top: "conv3_res13_conv1"
}
layer {
  name: "conv3_res13_conv2"
  type: "Convolution"
  bottom: "conv3_res13_conv1"
  top: "conv3_res13_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res13_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res13_conv2"
  top: "conv3_res13_conv2"
}
layer {
  name: "conv3_res13_conv2_scale"
  type: "Scale"
  bottom: "conv3_res13_conv2"
  top: "conv3_res13_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res13_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res13_conv2"
  top: "conv3_res13_conv2"
}
layer {
  name: "conv3_res13_conv3"
  type: "Convolution"
  bottom: "conv3_res13_conv2"
  top: "conv3_res13_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res13"
  type: "Eltwise"
  bottom: "conv3_res12"
  bottom: "conv3_res13_conv3"
  top: "conv3_res13"
}
layer {
  name: "conv3_res14_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res13"
  top: "conv3_res14_pre"
}
layer {
  name: "conv3_res14_pre_scale"
  type: "Scale"
  bottom: "conv3_res14_pre"
  top: "conv3_res14_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res14_pre_relu"
  type: "ReLU"
  bottom: "conv3_res14_pre"
  top: "conv3_res14_pre"
}
layer {
  name: "conv3_res14_conv1"
  type: "Convolution"
  bottom: "conv3_res14_pre"
  top: "conv3_res14_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res14_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res14_conv1"
  top: "conv3_res14_conv1"
}
layer {
  name: "conv3_res14_conv1_scale"
  type: "Scale"
  bottom: "conv3_res14_conv1"
  top: "conv3_res14_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res14_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res14_conv1"
  top: "conv3_res14_conv1"
}
layer {
  name: "conv3_res14_conv2"
  type: "Convolution"
  bottom: "conv3_res14_conv1"
  top: "conv3_res14_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res14_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res14_conv2"
  top: "conv3_res14_conv2"
}
layer {
  name: "conv3_res14_conv2_scale"
  type: "Scale"
  bottom: "conv3_res14_conv2"
  top: "conv3_res14_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res14_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res14_conv2"
  top: "conv3_res14_conv2"
}
layer {
  name: "conv3_res14_conv3"
  type: "Convolution"
  bottom: "conv3_res14_conv2"
  top: "conv3_res14_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res14"
  type: "Eltwise"
  bottom: "conv3_res13"
  bottom: "conv3_res14_conv3"
  top: "conv3_res14"
}
layer {
  name: "conv3_res15_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res14"
  top: "conv3_res15_pre"
}
layer {
  name: "conv3_res15_pre_scale"
  type: "Scale"
  bottom: "conv3_res15_pre"
  top: "conv3_res15_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res15_pre_relu"
  type: "ReLU"
  bottom: "conv3_res15_pre"
  top: "conv3_res15_pre"
}
layer {
  name: "conv3_res15_conv1"
  type: "Convolution"
  bottom: "conv3_res15_pre"
  top: "conv3_res15_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res15_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res15_conv1"
  top: "conv3_res15_conv1"
}
layer {
  name: "conv3_res15_conv1_scale"
  type: "Scale"
  bottom: "conv3_res15_conv1"
  top: "conv3_res15_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res15_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res15_conv1"
  top: "conv3_res15_conv1"
}
layer {
  name: "conv3_res15_conv2"
  type: "Convolution"
  bottom: "conv3_res15_conv1"
  top: "conv3_res15_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res15_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res15_conv2"
  top: "conv3_res15_conv2"
}
layer {
  name: "conv3_res15_conv2_scale"
  type: "Scale"
  bottom: "conv3_res15_conv2"
  top: "conv3_res15_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res15_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res15_conv2"
  top: "conv3_res15_conv2"
}
layer {
  name: "conv3_res15_conv3"
  type: "Convolution"
  bottom: "conv3_res15_conv2"
  top: "conv3_res15_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res15"
  type: "Eltwise"
  bottom: "conv3_res14"
  bottom: "conv3_res15_conv3"
  top: "conv3_res15"
}
layer {
  name: "conv3_res16_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res15"
  top: "conv3_res16_pre"
}
layer {
  name: "conv3_res16_pre_scale"
  type: "Scale"
  bottom: "conv3_res16_pre"
  top: "conv3_res16_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res16_pre_relu"
  type: "ReLU"
  bottom: "conv3_res16_pre"
  top: "conv3_res16_pre"
}
layer {
  name: "conv3_res16_conv1"
  type: "Convolution"
  bottom: "conv3_res16_pre"
  top: "conv3_res16_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res16_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res16_conv1"
  top: "conv3_res16_conv1"
}
layer {
  name: "conv3_res16_conv1_scale"
  type: "Scale"
  bottom: "conv3_res16_conv1"
  top: "conv3_res16_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res16_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res16_conv1"
  top: "conv3_res16_conv1"
}
layer {
  name: "conv3_res16_conv2"
  type: "Convolution"
  bottom: "conv3_res16_conv1"
  top: "conv3_res16_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res16_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res16_conv2"
  top: "conv3_res16_conv2"
}
layer {
  name: "conv3_res16_conv2_scale"
  type: "Scale"
  bottom: "conv3_res16_conv2"
  top: "conv3_res16_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res16_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res16_conv2"
  top: "conv3_res16_conv2"
}
layer {
  name: "conv3_res16_conv3"
  type: "Convolution"
  bottom: "conv3_res16_conv2"
  top: "conv3_res16_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res16"
  type: "Eltwise"
  bottom: "conv3_res15"
  bottom: "conv3_res16_conv3"
  top: "conv3_res16"
}
layer {
  name: "conv3_res17_pre_bn"
  type: "BatchNorm"
  bottom: "conv3_res16"
  top: "conv3_res17_pre"
}
layer {
  name: "conv3_res17_pre_scale"
  type: "Scale"
  bottom: "conv3_res17_pre"
  top: "conv3_res17_pre"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res17_pre_relu"
  type: "ReLU"
  bottom: "conv3_res17_pre"
  top: "conv3_res17_pre"
}
layer {
  name: "conv3_res17_conv1"
  type: "Convolution"
  bottom: "conv3_res17_pre"
  top: "conv3_res17_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res17_conv1_bn"
  type: "BatchNorm"
  bottom: "conv3_res17_conv1"
  top: "conv3_res17_conv1"
}
layer {
  name: "conv3_res17_conv1_scale"
  type: "Scale"
  bottom: "conv3_res17_conv1"
  top: "conv3_res17_conv1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res17_conv1_relu"
  type: "ReLU"
  bottom: "conv3_res17_conv1"
  top: "conv3_res17_conv1"
}
layer {
  name: "conv3_res17_conv2"
  type: "Convolution"
  bottom: "conv3_res17_conv1"
  top: "conv3_res17_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_res17_conv2_bn"
  type: "BatchNorm"
  bottom: "conv3_res17_conv2"
  top: "conv3_res17_conv2"
}
layer {
  name: "conv3_res17_conv2_scale"
  type: "Scale"
  bottom: "conv3_res17_conv2"
  top: "conv3_res17_conv2"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 1
    }
  }
}
layer {
  name: "conv3_res17_conv2_relu"
  type: "ReLU"
  bottom: "conv3_res17_conv2"
  top: "conv3_res17_conv2"
}
layer {
  name: "conv3_res17_conv3"
  type: "Convolution"
  bottom: "conv3_res17_conv2"
  top: "conv3_res17_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
